# ################################################################################
#                                                                                #
#   🖲️  CURSOR CONFIGURATION                                                     #
#   ---------------------                                                        #
#   Sets terminal cursor style and behavior for improved visual experience.     #
#                                                                                #
# ################################################################################

echo -ne '\e[5 q'
